#include <iostream> //стандартная библиотека для работы с выводом и вводом текста на экран     #include - функция подключения библиотеки

int main()//главная функция с которой начинаеться программа,, её находит компилятор по названию main
{
	std::cout<<"is,s working!";
	//std - namespace,, namespace нужен для того что-бы пользователь не запутался в функциях разных библиотека
	//cout - класс для вывода информации на экран
	// в конце вызова функций всегда ставиться ; <- обозначающая что команда завершена.
}